ucsb-seclab/pretender/test_programs/max32600/irq_blink_led/mbed/TARGET_MAX32600MBED/TARGET_Maxim/TARGET_MAX32600/device/trim_regs.h
/*******************************************************************************
 * Copyright (C) 2015 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *******************************************************************************
 */

#ifndef _MXC_TRIM_REGS_H
#define _MXC_TRIM_REGS_H

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

typedef struct {
    __IO uint32_t trim_reg_00;
    __IO uint32_t trim_reg_01;
    __IO uint32_t trim_reg_02;
    __IO uint32_t trim_reg_03;
    __IO uint32_t trim_reg_04;
    __IO uint32_t trim_reg_05;
    __IO uint32_t trim_reg_06;
    __IO uint32_t trim_reg_07;
    __IO uint32_t trim_reg_08;
    __IO uint32_t trim_reg_09;
    __IO uint32_t trim_reg_10;
    __IO uint32_t trim_reg_11;
    __IO uint32_t trim_reg_12;
    __IO uint32_t trim_reg_13;
    __IO uint32_t trim_reg_14;
    __IO uint32_t trim_reg_15;
    __IO uint32_t trim_reg_16;
    __IO uint32_t trim_reg_17;
    __IO uint32_t trim_reg_18;
    __IO uint32_t trim_reg_19;
    __IO uint32_t trim_reg_20;
    __IO uint32_t trim_reg_21;
    __IO uint32_t trim_reg_22;
    __IO uint32_t trim_reg_23;
    __IO uint32_t trim_reg_24;
    __IO uint32_t trim_reg_25;
    __IO uint32_t trim_reg_26;
    __IO uint32_t trim_reg_27;
    __IO uint32_t trim_reg_28;
    __IO uint32_t trim_reg_29;
    __IO uint32_t trim_reg_30;
    __IO uint32_t trim_reg_31;
    __IO uint32_t trim_reg_32;
    __IO uint32_t trim_reg_33;
    __IO uint32_t trim_reg_34;
    __IO uint32_t trim_reg_35;
    __IO uint32_t trim_reg_36;
    __IO uint32_t trim_reg_37;
    __IO uint32_t trim_reg_38;
    __IO uint32_t trim_reg_39;
    __IO uint32_t trim_reg_40;
    __IO uint32_t trim_reg_41;
} mxc_ftr_regs_t;

#ifdef __cplusplus
}
#endif

#endif /* _MXC_TRIM_REGS_H */
